{
  "heading": "Our Services",
  "subheading": "We combine science, experience, and passion to help you achieve long-lasting fitness results.",
  "sections": [
    {
      "title": "Personalized Training",
      "description": "Every body is unique. That's why we create custom workout plans tailored to your goals, lifestyle, and fitness level.",
      "paragraph": "Our certified trainers use advanced assessment techniques to understand your body mechanics, previous injuries, and personal preferences. We believe that cookie-cutter approaches don't work for everyone. Our methodology involves comprehensive fitness assessments, body composition analysis, and lifestyle evaluation to design programs that fit seamlessly into your daily routine. Whether you're a complete beginner or an experienced athlete, we adapt our training methods to challenge you appropriately while ensuring safe progression towards your goals.",
      "image": "/images/training.webp"
    },
    {
      "title": "Nutrition Planning",
      "description": "Fitness is 70% nutrition and 30% exercise. Our expert nutritionists craft meal plans to fuel your transformation.",
      "points": [
        "Balanced diet plans with macro and micronutrient optimization",
        "Supplements guidance based on your specific needs and goals",
        "Weekly check-ins to adjust your nutrition strategy",
        "Recipe recommendations and meal prep guidance",
        "Education on sustainable eating habits for long-term success"
      ],
      "image": "/images/diet.webp"
    },
    {
      "title": "Expert Community",
      "description": "Join a supportive community of certified trainers and like-minded fitness enthusiasts who will push you to succeed.",
      "paragraph": "Our community isn't just about accountability – it's about creating lasting friendships and connections with people who share your commitment to health and wellness. You'll find motivation, inspiration, and practical advice from members at every stage of their fitness journey. Through our exclusive online platform, you can participate in group challenges, share your progress, celebrate victories with others, and get support during tough times. Our trainers actively engage in community discussions, providing expert insights and answering questions. Regular virtual meetups, workout sessions, and educational webinars keep the community engaged and growing together.",
      "image": "/images/community.webp"
    },
    {
      "title": "24/7 Support",
      "description": "Your fitness journey doesn't stop when you leave the gym. We're here around the clock to answer your questions and keep you motivated.",
      "points": [
        "Chat support anytime through our mobile app and website",
        "Daily motivation tips and educational content delivered to your inbox",
        "Progress accountability with weekly check-ins and goal reviews",
        "Emergency workout modifications for travel or equipment changes",
        "Crisis motivation support when you're feeling unmotivated"
      ],
      "image": "/images/support.webp"
    }
  ]
}
